{
    "config":{
        // Interfaces to listen on. If host is not given, listen on all network adapters on that port.
        "listen": [
            { "host": "0.0.0.0", "port": 8088, "ssl": false },
            { "host": "0.0.0.0", "port": 8090, "ssl": true },
        ],
        "cert": "localhost.pem",
        "listen_threads": 0,
    },
    "matrix": {
        "hashcache": {
            "pepperTime": "1h", // hash pepper is rotated after this time
            "pepperLen": [24, 40], // each hash pepper is this long; in [min, max]
        },
        "wellknown": {
            "cacheTime": "1h", // well-known/SRV entries are cached this long before re-requesting
            "failTime": "10m", // failed well-known/SRV lookups are cached as failed for this long
            "requestTimeout": "5s", // timeout when looking up homeservers via .well-known or SRV record before a request is considered failed
            "requestMaxSize": 50000, // truncate reply after this many bytes (protection against malicious servers)
        },
        "register": {
            "maxTime": "24h", // max. allowable session length until clients need to request a new token
        },
        "hashes": {
            // per-hash settings:
            // lazy [bool]: regenerate hashes only when a client asks for a hash of this type. Saves RAM. Default: true
            // default:  { "lazy": true  },
            "sha256":    { "lazy": true  }, // must be present and enabled according to the matrix spec
            "none":      { "lazy": true  }, // if enabled, allows for bulk lookup and substring matching
            "sha512":    { "lazy": true  },
            "sha3-512":  { "lazy": true  },
        },
        "minSearchLen": 2, // any search term must be at least this long; else it's ignored
    },

    "sources": {
        /* Completely purge & reload the entire 3pid tree every now and then.
           Fetches all sources as if on program startup, then atomically replaces the tree once everything is loaded.
           Gets rid of stale entries. Clears hash caches. Comment out to never purge (not recommended). */
        "purgeEvery": "3h",
        
        /* Fetching sources happens as follows:
        exec: Executes this file/script/program and parses its stdout as JSON.
              - Can either use a string to exec that file without parameters
              - Can also use an array to specify file name and parameters
        load: Load this file as JSON.
        every: takes a time delay to do this action repeatly
               (If not present, this is done only once on startup)
        check: By default, each exec'd source is checked during startup to ensure the process will execute cleanly.
               External scripts can use this to eg. check that all required dependencies are available on the system.
               For the check, the process is run with --check as its only parameter. If it exits with status 0,
               the check is considered successful.
               If one check fails the process will terminate on startup and display a big honking error.
               (default: true. Set to false to skip the check.)
        ----
        Each resulting json tree is kept separately. Whenever the 3pid database is updated,
        ie. one source has been loaded or executed, all trees are merged to the final 3pid tree.
        (This is to make sure no deleted entries linger in the 3pid tree)
        */
        "list": [
            // Some examples:
            // Load a JSON file from disk
            //{ "load": "example_users.json" },
            
            // Call a script that outputs JSON
            //{ "exec": "example_users.sh", "every": "30m", "check": true },
            
            // Feel free to write your own data importer and call it here.
            // The format is:
            // { "medium": {"3pid": "mxid", "3pid": "mxid", .... }, "medium2": {...} }
            // Where medium is something like phone or email, 3pid is your identifier and mxid is the associated matrix account name.
            // (Yes you can have multiple 3pids of the same medium map to a single mxid!)
            // You can also provide multiple media in one go.
        ],
    },
    
    // environment variables passed to external processes. Put passwords and stuff here.
    "env": {
        // "MY_ENV_VAR": "whatever",
    },
}
